Revit 2024 API
UpdaterId.GetGUID Method
 GUID value of the UpdaterId
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2011
Syntax
C#
public Guid GetGUID()
Visual Basic
Public Function GetGUID As Guid
Visual C++
public:
Guid GetGUID()
See Also
UpdaterId Class
Autodesk.Revit.DB Namespace